Revit 2027 API
BuiltInFailures.MassFailures.DividePerimeterZoneFailed Property
 Failed to divide perimeter zone.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividePerimeterZoneFailed { get; }
Public Shared ReadOnly Property DividePerimeterZoneFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividePerimeterZoneFailed {
	FailureDefinitionId^ get ();
}
static member DividePerimeterZoneFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace